RDVMI.rdvmi-ext/src/InformationRegisters/рдв_РегистрацияИзменений/рдв_РегистрацияИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_РегистрацияИзменений</name>
  <resources>
    <name>ВыгружаемыйОбъект</name>
    <type>
      <types>CatalogRef.рдв_ВыгружаемыеОбъекты</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.рдв_СтатусыРегистрацииИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>АдресМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.рдв_ВидыСообщенийИнтеграции</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДатаРегистрацииВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.рдв_ВнешниеСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/InformationRegisters/рдв_ОчередиОбработкиДанных/рдв_ОчередиОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_ОчередиОбработкиДанных</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.рдв_СостоянияОчередейОбработкиДанных</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеПараметров</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РазделительПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСледующейПопыткиUTC</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОстановленаОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеСостояния</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаОбработкиUTC</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаСозданияUTC</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияСостоянияUTC</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеПараметров</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ТипОчереди</name>
    <type>
      <types>CatalogRef.рдв_ТипыОчередейОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешПараметров</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RDVMI.rdvmi-ext/src/Enums/рдв_СостоянияОчередейОбработкиДанных/рдв_СостоянияОчередейОбработкиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рдв_СостоянияОчередейОбработкиДанных</name>
  <comment>VELO-625</comment>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Пропущена</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

RDVMI.rdvmi-ext/src/CommonModules/рдв_МониторингДанных/Module.bsl
Процедура РегламентОтправкиСообщенийДиагностики() Экспорт

	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.рдв_ОтправкаСообщенийДиагностики);
	
	ЗарегистрироватьСообщениеДиагностики();
	
КонецПроцедуры

Процедура ЗарегистрироватьСообщениеДиагностики()

	ВнешняяСистемаМонторинга = рдв_МенеджерОбменаПереопределяемый.ВнешняяСистемаМониторинга();
	Если ВнешняяСистемаМонторинга = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Пинг = Справочники.рдв_ВыгружаемыеОбъекты.СоздатьВыгружаемыйОбъектДиагностики();
	рдв_РегистрацияИзменений.ЗарегистрироватьДанныеДиагностики(ВнешняяСистемаМонторинга
																		, "exchange"
																		, Пинг);

КонецПроцедуры
																																			
Функция ПодготовитьДанныеДиагностики() Экспорт

	Возврат ДанныеКВыгрузке();	
	
КонецФункции

Функция ДанныеКВыгрузке()
	
	ДанныеКВыгрузке = Новый Структура("incoming_queue, outgoing_queue", 0, 0); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.outgoing_queue КАК outgoing_queue,
	|	ВложенныйЗапрос.incoming_queue КАК incoming_queue
	|ИЗ
	|	(ВЫБРАТЬ
	|		0 КАК incoming_queue,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ рдв_РегистрацияИзменений.ДатаРегистрацииВМиллисекундах) КАК outgoing_queue
	|	ИЗ
	|		РегистрСведений.рдв_РегистрацияИзменений КАК рдв_РегистрацияИзменений
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ рдв_ОчередиОбработкиДанных.ИдентификаторЗаписи),
	|		0
	|	ИЗ
	|		РегистрСведений.рдв_ОчередиОбработкиДанных КАК рдв_ОчередиОбработкиДанных
	|	ГДЕ
	|		рдв_ОчередиОбработкиДанных.Состояние <> ЗНАЧЕНИЕ(Перечисление.рдв_СостоянияОчередейОбработкиДанных.Выполнена)
	|		И рдв_ОчередиОбработкиДанных.ТипОчереди.ИмяОчереди = ""ОбработкаВходящихСообщений"") КАК ВложенныйЗапрос";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеКВыгрузке, Выборка);
	КонецЕсли;
	
	Возврат ДанныеКВыгрузке;
	
КонецФункции
